/*
  String_ui.strings
  iina

  Created by lhc on 3/1/2017.
  Copyright © 2017 lhc. All rights reserved.
*/
// Common

"general.on" = "On";
"general.off" = "Off";
"general.login" = "Login";
"general.logout" = "Logout";
"general.ok" = "OK";
"general.cancel" = "Cancel";
"general.username" = "Username";
"general.password" = "Password";
"general.na" = "N/A";

"input.value_is_empty" = "Value cannot be empty.";
"input.already_exists" = "Value already exists.";

// Guide Window
"guide.highlights" = "Highlights";
"guide.basic_settings" = "Basic Settings";
"guide.faq" = "Frequently Asked Questions";

// Initial Window
"initial.announcement" = "You are using a %@ version of IINA";
"initial.beta.desc" = "If you want to rollback to a release version, uncheck \"receive beta updates\" from Settings > General, and install a stable release from our <a href=\"https://iina.io\">official website</a>.";
"initial.nightly.desc" = "Nightly is not recommended to be used as your daily driver. Currently nightly builds do not support auto update. Please manually download newer builds from our <a href=\"https://nightly.iina.io\">nightly website</a>.";
"initial.debug.desc" = "Debug builds are usually not optimized for performance, so it is not recommended to be used as daily drive. Debug builds do not support auto update.";
"initial.bug_report" = "Report via <a href=\"https://github.com/iina/iina/issues\">GitHub issues</a>.";

// Inspector Window
"inspector.error" = "Error";

// MainWindowController.swift
"main.buffering_indicator" = "Buffering… %d%%";
"main.opening_stream" = "Opening stream…";
"main.seeking_indicator" = "Seeking…";
"osc.precision" = "Precision";
"osc.1s" = "1 second";
"osc.100ms" = "100 milliseconds";
"osc.10ms" = "10 milliseconds";
"osc.1ms" = "1 millisecond";

// QuickSettingViewController.swift
"quicksetting.item_default" = "Default";
"quicksetting.item_none" = "None";
"quicksetting.hwdec" = "Hardware Decoding";
"quicksetting.deinterlace" = "Deinterlace";
"quicksetting.hdr" = "HDR";
"quicksetting.hide" = "Hide";
"quicksetting.reset_speed" = "Reset speed to 1x";

// EQ Presets
"eq.preset.flat" = "Flat";
"eq.preset.acoustic" = "Acoustic";
"eq.preset.classical" = "Classical";
"eq.preset.dance" = "Dance";
"eq.preset.deep" = "Deep";
"eq.preset.electronic" = "Electronic";
"eq.preset.hip_hop" = "Hip Hop";
"eq.preset.increase_bass" = "Increase Bass";
"eq.preset.increase_treble" = "Increase Treble";
"eq.preset.increase_vocal" = "Increase Vocal";
"eq.preset.jazz" = "Jazz";
"eq.preset.latin" = "Latin";
"eq.preset.loundness" = "Loundness";
"eq.preset.lounge" = "Lounge";
"eq.preset.piano" = "Piano";
"eq.preset.pop" = "Pop";
"eq.preset.rnb" = "R&B";
"eq.preset.reduce_bass" = "Reduce Bass";
"eq.preset.reduce_treble" = "Reduce Treble";
"eq.preset.rock" = "Rock";
"eq.preset.small_speaker" = "Small Speaker";
"eq.preset.spoken_word" = "Spoken Word";

"alert.eq.new_profile.title" = "New EQ Profile";
"alert.eq.new_profile.message" = "Please enter a profile name.";
"alert.eq.rename.title" = "Rename Current Profile";
"alert.eq.rename.message" = "Please enter a new profile name.";

// OSDMessage.swift
"osd.pause" = "Pause";
"osd.resume" = "Resume";
"osd.volume" = "Volume: %@";
"osd.speed" = "Speed: %@x";
"osd.aspect" = "Aspect Ratio: %@";
"osd.crop" = "Crop: %@";
"osd.rotate" = "Rotate: %i°";
"osd.deinterlace" = "Deinterlace: %@";
"osd.hwdec" = "Hardware Decoding: %@";
"osd.audio_delay.nodelay" = "Audio Delay: No Delay";
"osd.audio_delay.later" = "Audio Delay: %@s Later";
"osd.audio_delay.earlier" = "Audio Delay: %@s Earlier";
"osd.sub_delay.nodelay" = "Subtitle Delay: No Delay";
"osd.sub_delay.later" = "Subtitle Delay: %@s Later";
"osd.sub_delay.earlier" = "Subtitle Delay: %@s Earlier";
"osd.subtitle_pos" = "Subtitle Position: %@";
"osd.sub_hidden" = "Subtitles Hidden";
"osd.sub_visible" = "Subtitles Visible";
"osd.sub_second_delay.nodelay" = "Secondary Subtitle Delay: No Delay";
"osd.sub_second_delay.later" = "Secondary Subtitle Delay: %@s Later";
"osd.sub_second_delay.earlier" = "Secondary Subtitle Delay: %@s Earlier";
"osd.sub_second_hidden" = "Secondary Subtitles Hidden";
"osd.sub_second_pos" = "Secondary Subtitle Position: %@";
"osd.sub_second_visible" = "Secondary Subtitles Visible";
"osd.mute" = "Mute";
"osd.unmute" = "Unmute";
"osd.screenshot" = "Screenshot Captured";
"osd.abloop.a" = "AB-Loop: A";
"osd.abloop.b" = "AB-Loop: B";
"osd.abloop.clear" = "AB-Loop: Cleared";
"osd.stop" = "Stop";
"osd.chapter" = "Chapter: %@";
"osd.subtitle_scale" = "Subtitle Scale: %@x";
"osd.add_to_playlist" = "Added %i Files to Playlist";
"osd.clear_playlist" = "Cleared Playlist";
"osd.video_eq.contrast" = "Contrast: %i";
"osd.video_eq.gamma" = "Gamma: %i";
"osd.video_eq.hue" = "Hue: %i";
"osd.video_eq.saturation" = "Saturation: %i";
"osd.video_eq.brightness" = "Brightness: %i";
"osd.find_online_sub" = "Finding online subtitles…";
"osd.find_online_sub.source" = "from";
"osd.sub_not_found" = "No subtitles found";
"osd.sub_found" = "%d subtitles found.";
"osd.sub_downloading" = "Downloading %d subtitles";
"osd.sub_downloaded" = "Subtitle downloaded";
"osd.sub_saved" = "Subtitle saved";
"osd.network_error" = "Network error";
"osd.file_error" = "Error reading file";
"osd.cannot_login" = "Cannot login";
"osd.canceled" = "Canceled";
"osd.cannot_connect" = "Cannot connect";
"osd.timed_out" = "Timed Out";
"osd.filter_added" = "Added Filter: %@";
"osd.filter_removed" = "Removed Filter";
"osd.file_loop" = "Loop Single File";
"osd.playlist_loop" = "Loop Playlist";
"osd.no_loop" = "Disable Looping";

"preference.title" = "Settings";
"preference.general" = "General";
"preference.ui" = "UI";
"preference.video_audio" = "Video/Audio";
"preference.subtitle" = "Subtitle";
"preference.network" = "Network";
"preference.control" = "Control";
"preference.keybindings" = "Key Bindings";
"preference.advanced" = "Advanced";
"preference.plugins" = "Plugins";
"preference.utilities" = "Utilities";
"preference.scripts" = "Scripts";
"preference.not_logged_in" = "Not logged in";
"preference.logged_in_as" = "Logged in as %@";
"preference.system_media_control" = "Use system media control";

"preference.key_binding_hint_1" = "To edit key bindings in current configuration file, click \"Duplicate…\" button first to create a copy.";
"preference.key_binding_hint_2" = "Double click a row at the right side to edit the corresponding key binding.";

"preference.enable_adv_settings" = "Enable advanced settings";

"preference.sub_override_level.no" = "no";
"preference.sub_override_level.force" = "force";
"preference.sub_override_level.scale" = "scale";
"preference.sub_override_level.strip" = "strip";
"preference.sub_override_level.yes" = "yes";

"preference.sub_override_level.descriptive_text.no" = "Render subtitles as specified by the subtitle scripts, without overrides.";
"preference.sub_override_level.descriptive_text.force" = "Apply all subtitle styles.";
"preference.sub_override_level.descriptive_text.scale" = "Apply the scale setting in addition to the style settings in this section.";
"preference.sub_override_level.descriptive_text.strip" = "Radically strip all ASS tags and styles from the subtitle.";
"preference.sub_override_level.descriptive_text.yes" = "Apply all the style settings in this section.";

"preference.ytdl_plugin_not_installed" = "Install the Online Media plugin from \"Plugins > Install from GitHub\" to enjoy advanced features such and video downloading and auto yt-dlp updates.";
"preference.ytdl_plugin_installed" = "The built-in youtube-dl support is disabled since you have the Online media plugin installed.";

"menu.volume" = "Volume: %@";
"menu.volume_muted" = "Volume: %@ (Muted)";
"menu.audio_delay" = "Audio Delay: %@s";
"menu.sub_delay" = "Subtitle Delay: %@s";
"menu.sub_hide" = "Hide Subtitles";
"menu.sub_show" = "Show Subtitles";
"menu.sub_second_hide" = "Hide Secondary Subtitles";
"menu.sub_second_show" = "Show Secondary Subtitles";
"menu.fullscreen" = "Enter Full Screen";
"menu.exit_fullscreen" = "Exit Full Screen";
"menu.pip" = "Enter Picture-in-Picture";
"menu.exit_pip" = "Exit Picture-in-Picture";
"menu.mini_player" = "Enter Music Mode";
"menu.exit_mini_player" = "Exit Music Mode";
"menu.pause" = "Pause";
"menu.resume" = "Resume";
"menu.speed" = "Speed: %@x";
"menu.chapters" = "Show Chapters Panel";
"menu.hide_chapters" = "Hide Chapters Panel";
"menu.playlist" = "Show Playlist Panel";
"menu.hide_playlist" = "Hide Playlist Panel";
"menu.video" = "Show Video Panel";
"menu.hide_video" = "Hide Video Panel";
"menu.audio" = "Show Audio Panel";
"menu.hide_audio" = "Hide Audio Panel";
"menu.subtitles" = "Show Subtitles Panel";
"menu.hide_subtitles" = "Hide Subtitles Panel";

"menu.seek_forward" = "Step Forward %@s";
"menu.seek_backward" = "Step Backward %@s";
"menu.speed_up" = "Speed Up by %@x";
"menu.speed_down" = "Speed Down by %@x";
"menu.volume_up" = "Volume + %@%%";
"menu.volume_down" = "Volume - %@%%";
"menu.audio_delay_up" = "Audio Delay + %@s";
"menu.audio_delay_down" = "Audio Delay - %@s";
"menu.sub_delay_up" = "Subtitle Delay + %@s";
"menu.sub_delay_down" = "Subtitle Delay - %@s";

"menu.crop_custom" = "Custom…";
"menu.find_online_sub" = "Find Online Subtitles from %@";

"menu.manage_plugins" = "Manage Plugins…";
"menu.developer_tool" = "Developer Tool";
"menu.more_plugin" = "More…";
"menu.conflicting_shortcuts" = "Conflicting key shortcuts…";
"menu.reload_plugins" = "Reload All Plugins";
"menu.show_plugins_panel" = "Show Plugins Panel";
"menu.hide_plugins_panel" = "Hide Plugins Panel";

"track.audio" = "Audio";
"track.none" = "<None>";
"track.sub" = "Subtitle";
"track.video" = "Video";

"subtrack.no_loaded" = "No Subtitles Loaded";
"subtrack.no_external" = "No External Subtitles Found";

// Alerts
"alert.beta_channel.title" = "Receive Updates for Beta Versions";

"alert.title_error" = "Error";
"alert.title_warning" = "Warning";
"alert.title_info" = "Information";

"alert.fatal_error" = "Fatal error: %@ \nThe application will exit now.";
"alert.mpv_error" = "Internal error %@ (%@) when setting option %@.";

"alert.unsupported_audio" = "Unsupported external audio file.";
"alert.unsupported_video" = "Unsupported external video file.";
"alert.unsupported_sub" = "Unsupported external subtitle.";
"alert.unsupported_url" = "Unsupported URL.";
"alert.wrong_url_format" = "Wrong URL format.";

"alert.error_open" = "Cannot open file or stream!";
"alert.error_finding_file" = "Cannot find %@ file!";
"alert.error_loading_script" = "Cannot load script %@!";
"alert.error_saving_file" = "Error occurred when saving %@: %@";
"alert.error_deleting_file" = "Cannot delete the file.";

"alert.target_peak.bad_value" = "The value \"%@\" is invalid.\nPlease provide a value between 10 and 10000, or 0.";

"alert.config.new.title" = "New Input Configuration";
"alert.config.new.message" = "Please enter a name for the new configuration.";
"alert.config.duplicate.title" = "Duplicate Configuration";
"alert.config.duplicate.message" = "Please enter name for the duplicated configuration file.";
"alert.config.file_existing.title" = "File Already Exists";
"alert.config.file_existing.message" = "A config file with the same filename already exists. Choose OK to show the file in Finder.";
"alert.config.cannot_create" = "Cannot create config file!\n%@";
"alert.config.cannot_write" = "Cannot write to config file!";
"alert.config.rename.title" = "Rename Input Configuration";
"alert.config.rename.message" = "Please enter the new name for the configuration.";

"alert.filter.incorrect" = "Error occurred when setting filters. Please check your parameter format.";
"alert.add_filter.title" = "New Filter";
"alert.add_filter.message" = "Please enter a filter string in format of mpv's vf or af command.";

"alert.keybinding_config.error" = "Error parsing keybinding configuration file \"%@\"! Fallback to IINA Default keybinding setting. Please check your configuration.";

"alert.extra_option.cannot_read" = "Cannot read user defined extra mpv options.";
"alert.extra_option.empty" = "Key or value cannot be empty!";
"alert.extra_option.error" = "Error setting option --%@=%@ with return value %d. Please check your extra option settings in Preference > Advanced.";
"alert.extra_option.config_folder" = "Error setting config directory \"%@\".";

"alert.playlist.error_deleting" = "Error deleting: %@";

"alert.screenshot.error_taking" = "Cannot take a screenshot!";

"alert.sub.no_selected" = "Please select a downloaded subtitle first.";
"alert.sub_lang_not_set" = "Please set preferred subtitle languages in Settings before using OpenSubtitles. English(eng) will be used this time.";
"alert.sub.cannot_save_passwd" = "Cannot save your password to Keychain: %@";
"alert.sub.cannot_login" = "Cannot login. Please check your username, password and network status.\n\n%@";
"alert.sub.save_downloaded.title" = "Save Downloaded Subtitle";

"alert.set_default.title" = "Setting IINA as Default App";
"alert.set_default.message" = "IINA will be set as the default app for all file types it supports.";
"alert.set_default.success" = "Finished with %d success and %d failed.";

"alert.add_watch.title" = "Add Watch Property";
"alert.add_watch.message" = "Please enter a valid mpv property name.";

"alert.jump_to.title" = "Jump to";
"alert.jump_to.message" = "Please enter the time you want to jump to. Example: 20:35";

"alert.opensub.login.title" = "OpenSubtitles Login";
"alert.opensub.login.message" = "Please enter your username and password";

"alert.open_url.title" = "Open URL";
"alert.open_url.message" = "Please enter the URL:";
"alert.choose_media_file.title" = "Choose Media Files";

"alert.add_url.title" = "Add URL";
"alert.add_url.message" = "Please enter the URL:";

"alert.delete_history.title" = "Delete Playback History";
"alert.delete_history.message" = "Are you sure to delete selected entries?";

"alert.filter_hwdec.message" = "You are about to apply a video filter. However, your current hardware decoder may not support video filters well. You can either disable hardware decoding or switch to Auto(Copy), which will consume twice the memory.\nYou may need to repeat previous operation (like setting the crop) to make it work.";
"alert.filter_hwdec.abort" = "Abort";
"alert.filter_hwdec.turn_off" = "Turn off hardware decoding";
"alert.filter_hwdec.use_copy" = "Switch to Auto(Copy)";

"alert.clear_cache.title" = "Clear Thumbnail Cache";
"alert.clear_cache.message" = "Are you sure to clear all thumbnail Cache?";

"alert.clear_history.title" = "Clear Playback History";
"alert.clear_history.message" = "Are you sure to delete all playback history?";

"alert.clear_watch_later.title" = "Clear Saved Playback Progress";
"alert.clear_watch_later.message" = "Are you sure to delete all saved playback progress (\"watch later\" data)?";

"alert.restore_alerts.title" = "Restore Suppressed Alerts";
"alert.restore_alerts.message" = "Are you sure you want to restore suppressed alerts?";

"alert.nothing_to_open" = "Nothing to open.";

"alert.no_video_track" = "There is no video track.";

"alert.duplicate_config" = "You cannot edit default configurations directly. Please duplicate one before editing.";

"alert.assrt_register" = "Due to limited API quota, you are strongly recommended to use your own API token. The default token is only for demo usage, and you may encounter network error.";
"alert.assrt_register.register" = "Register Now";
"alert.assrt_register.try" = "Try First";
"alert.assrt_token_prompt.title" = "Enter your API token";
"alert.assrt_token_prompt.message" = "Please register in the opened webpage. Get your token in your user home page and enter it below:";
"alert.assrt_token_invalid" = "Your Assrt API token seems to be invalid.";

"alert.plugin_uninstall.title" = "Are you sure to uninstall %@?";
"alert.plugin_uninstall.message" = "The plugin will be deleted from your disk.";
"alert.plugin_reinstall.title" = "Plugin %@ already exists";
"alert.plugin_reinstall.message" = "Do you want to reinstall the plugin?";
"alert.duplicated_plugin_id" = "Duplicated plugin identifiers detected. Two or more plugins have the same identifier \"%@\". This may cause abnormal behaviors. Please find them in Settings - Plugins and report to their authors. If a plugin is installed locally, you can also manually change its identifier in the plugin's Info.json file.";
"alert.plugin_no_update" = "No update found.";
"alert.plugin_update_found.title" = "Update found for %@";
"alert.plugin_update_found.message" = "The latest version is %@. You have %@. Would you like to update?";
"alert.plugin_permission" = "This plugin requires the following permissions. Please review them before proceeding.";
"alert.plugin_permission_added" = "This update requires additional permissions. Please review them before proceeding.";

"playlist.total_length" = "%@ in total";
"playlist.total_length_with_selected" = "%@ of %@ selected";
"playlist.sorting.header" = "Sorting";
"playlist.sorting.filename_ascending" = "Filename Ascending";
"playlist.sorting.filename_descending" = "Filename Descending";
"playlist.sorting.path_ascending" = "File Path Ascending";
"playlist.sorting.path_descending" = "File Path Descending";
"pl_menu.title_multi" = "%d Items";
"pl_menu.play_next" = "Play Next";
"pl_menu.play_in_new_window" = "Play in New Window";
"pl_menu.remove" = "Remove";
"pl_menu.remove_multi" = "Remove Selected";
"pl_menu.delete" = "Move to Trash";
"pl_menu.delete_multi" = "Move Selected Files to Trash";
"pl_menu.delete_after_play" = "Move to Trash After Playback";
"pl_menu.delete_after_play_multi" = "Move Selected Files to Trash After Playback";
"pl_menu.show_in_finder" = "Show in Finder";
"pl_menu.add_file" = "Add File…";
"pl_menu.add_url" = "Add URL…";
"pl_menu.clear_playlist" = "Clear Playlist";
"pl_menu.matched_sub" = "Matched %d Subtitle(s)";
"pl_menu.add_sub" = "Add Subtitle…";
"pl_menu.wrong_sub" = "Wrong Subtitle!";
"pl_menu.browser" = "Open in Browser";
"pl_menu.copy_url" = "Copy URL";
"pl_menu.copy_url_multi" = "Copy URLs";

"keymapping.title" = "Key Mapping";
"keymapping.message" = "Press any key to record.";

"filter.video_filters" = "Video Filters";
"filter.audio_filters" = "Audio Filters";

"hwdec.no" = "Disable hardware decoding.";
"hwdec.auto" = "Enable hardware decoding. However, most of the video filters won't work properly.";
"hwdec.auto-copy" = "Enable hardware decoding. It will consume double the memory but work with video filters.";

"gaplessAudio.no" = "Playback of consecutive audio files may result in silence or disruption at the point of file change.";
"gaplessAudio.weak" = "If the audio format the decoder output changes, the audio device is closed and reopened, disrupting gapless playback.";
"gaplessAudio.yes" = "The audio device is opened using parameters chosen for the first file played and is then kept open for gapless playback. Following files may be resampled.";

"subencoding.auto" = "Auto detect";

"osc_toolbar.settings" = "Quick Settings";
"osc_toolbar.playlist" = "Playlist and chapters";
"osc_toolbar.pip" = "Toggle Picture-in-Picture";
"osc_toolbar.full_screen" = "Toggle full screen";
"osc_toolbar.music_mode" = "Enter music mode";
"osc_toolbar.sub_track" = "Choose subtitle track";
"osc_toolbar.screenshot" = "Take a screenshot";
"osc_toolbar.plugins" = "Show plugins panel";

"mini_player.album_art" = "Toggle album art";
"mini_player.loop" = "Repeat";
"mini_player.shuffle" = "Shuffle";
"mini_player.remove" = "Remove from playlist";
"mini_player.add" = "Add to playlist";
"mini_player.delete" = "Delete all tracks from playlist";
"mini_player.volume" = "Volume";
"mini_player.close" = "Close music mode";
"mini_player.back" = "Return to video mode";
"mini_player.sort" = "Sort the playlist";

// Touch bar

"touchbar.ahead_15" = "15sec Ahead";
"touchbar.ahead_30" = "30sec Ahead";
"touchbar.back_15" = "15sec Back";
"touchbar.back_30" = "30sec Back";
"touchbar.next_video" = "Next Video";
"touchbar.prev_video" = "Previous Video";
"touchbar.increase_volume" = "Volume +";
"touchbar.decrease_volume" = "Volume -";
"touchbar.rewind" = "Rewind";
"touchbar.fast_forward" = "Fast Forward";
"touchbar.play_pause" = "Play / Pause";
"touchbar.seek" = "Seek";
"touchbar.time" = "Time Position";
"touchbar.remainingTimeOrTotalDuration" = "Remaining Time / Total Duration";
"touchbar.toggle_pip" = "Toggle Picture-in-Picture";

// Plugin permissions

"permissions.network-request.name" = "Network Request";
"permissions.network-request.desc" = "This plugin can make requests from or upload data to these websites:";
"permissions.network-request.any_site" = "Any site";
"permissions.show-osd.name" = "Show OSD";
"permissions.show-osd.desc" = "This plugin can show OSD (On Screen Display) messages.";
"permissions.show-alert.name" = "Show Alerts";
"permissions.show-alert.desc" = "This plugin can show pop-up alerts.";
"permissions.video-overlay.name" = "Add overlays on videos";
"permissions.video-overlay.desc" = "This plugin can render additional content on the top of the video.";
"permissions.file-system.name" = "Access the file system";
"permissions.file-system.desc" = "This plugin can read or write files on your disk, which may include sensitive information. It can also execute other programs or applications that can harm your computer. So be sure to verify the source.";

"plugin.install" = "Install";
"plugin.installed" = "Installed";
"plugin.not_installed" = "Not Installed";
"plugin.local" = "Installed locally";
"alert.plugin.install_error" = "Error occurred during the installation: %@";
"alert.invalid_url" = "The URL is invalid.";
"plugin.install_error.invalid_url" = "The URL is invalid.";
"plugin.install_error.file_not_found" = "Cannot find the package file.";
"plugin.install_error.cannot_download" = "Failed to download the plugin.\n\nOutput:%@\n";
"plugin.install_error.cannot_unpackage" = "Failed to unpackage the plugin.\n\nOutput:%@\n";
"plugin.install_error.cannot_load" = "IINA cannot load this plugin. It might be in the wrong format.";
"plugin.check_for_updates" = "Check for Updates";
"plugin.updating" = "Downloading update…";
